In [2]:
import pandas as pd
given_list = [5, 10, 15, 12, 41]

series = pd.Series(given_list)

print(series)

0     5
1    10
2    15
3    12
4    41
dtype: int64

In [18]:


date_series = pd.date_range(start = '05-01-2021', end = '05-12-2021')

print(date_series)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [17]:
dictionary = {'name': ['Amal', 'Arun','Akhil'],
              'age' : [22, 29, 25],
              'occ' : ['Scientist', 'Actor', 'CEO(Google)']}

dataframe = pd.DataFrame(dictionary)

print(dataframe)

   age   name          occ
0   22   Amal    Scientist
1   29   Arun        Actor
2   25  Akhil  CEO(Google)

In [16]:
lists = [[2, 'Sanal', 22],
         [1, 'Rohit', 25],
         [1, 'Athma', 24]]

dataframe = pd.DataFrame(lists, columns = ['id', 'name', 'age'])

print(dataframe)

   id   name  age
0   2  Sanal   22
1   1  Rohit   25
2   1  Athma   24

In [15]:
dataframe = pd.read_csv('data.csv')

print(dataframe)

   id      name  age  occupation      salary
0   1  ABhijith   22    engineer     20000.0
1   3      John   24  accountant         NaN
2   2    AChuth   25      doctor    120000.0
3   4    Akshay   23      Crypto  12000000.0
4   5      Arun   24   Developer         NaN

In [14]:
print(dataframe)

print()

dataframe_customindex = dataframe.set_index('id')

print(dataframe_customindex)

   id      name  age  occupation      salary
0   1  ABhijith   22    engineer     20000.0
1   3      John   24  accountant         NaN
2   2    AChuth   25      doctor    120000.0
3   4    Akshay   23      Crypto  12000000.0
4   5      Arun   24   Developer         NaN

        name  age  occupation      salary
id
1   ABhijith   22    engineer     20000.0
3       John   24  accountant         NaN
2     AChuth   25      doctor    120000.0
4     Akshay   23      Crypto  12000000.0
5       Arun   24   Developer         NaN

In [13]:

print(dataframe)

print()

dataframe_sorted = dataframe.sort_values(by = ['id', 'age'])

print(dataframe_sorted)

   id      name  age  occupation      salary
0   1  ABhijith   22    engineer     20000.0
1   3      John   24  accountant         NaN
2   2    AChuth   25      doctor    120000.0
3   4    Akshay   23      Crypto  12000000.0
4   5      Arun   24   Developer         NaN

   id      name  age  occupation      salary
0   1  ABhijith   22    engineer     20000.0
2   2    AChuth   25      doctor    120000.0
1   3      John   24  accountant         NaN
3   4    Akshay   23      Crypto  12000000.0
4   5      Arun   24   Developer         NaN

In [12]:
print(dataframe)

print()

o = dataframe.iloc[[0,1], :]

print(o)

   id      name  age  occupation      salary
0   1  ABhijith   22    engineer     20000.0
1   3      John   24  accountant         NaN
2   2    AChuth   25      doctor    120000.0
3   4    Akshay   23      Crypto  12000000.0
4   5      Arun   24   Developer         NaN

   id      name  age  occupation   salary
0   1  ABhijith   22    engineer  20000.0
1   3      John   24  accountant      NaN

In [11]:
print(dataframe)

print()

occ_average_age = dataframe.groupby('occupation')['salary'].mean()
print(occ_average_age)

   id      name  age  occupation      salary
0   1  ABhijith   22    engineer     20000.0
1   3      John   24  accountant         NaN
2   2    AChuth   25      doctor    120000.0
3   4    Akshay   23      Crypto  12000000.0
4   5      Arun   24   Developer         NaN

occupation
Crypto        12000000.0
Developer            NaN
accountant           NaN
doctor          120000.0
engineer         20000.0
Name: salary, dtype: float64

In [40]:
print(dataframe) 

print()

dataframe_nullfill = dataframe.fillna(0)

print(dataframe_nullfill)

      eid   ename  stipend     eid         position
0  0    1   Rohit    23000  0    1         employee
1  1    2   Varun    12000  1    2         employee
2  2    3   Domnic    3000  2    3           intern
3  3    4   Harsh    25000  3    4  senior_employee

      eid   ename  stipend     eid         position
0  0    1   Rohit    23000  0    1         employee
1  1    2   Varun    12000  1    2         employee
2  2    3   Domnic    3000  2    3           intern
3  3    4   Harsh    25000  3    4  senior_employee

In [22]:
c_data = pd.read_csv('company.csv')

print(c_data)

print()

c_data['profit'] = c_data['profit'].apply(lambda x:x>0)

print(c_data)

                  cname  profit
0            Amul Milks   90000
1                KD&Co.   10000
2  National Electronics   -5000
3      Bharath Medicals   85000
4          Akhil Stores  -90000

                  cname  profit
0            Amul Milks    True
1                KD&Co.    True
2  National Electronics   False
3      Bharath Medicals    True
4          Akhil Stores   False

In [42]:
empdata = pd.read_csv('employee.csv')
companydata = pd.read_csv('companydata.csv')

print(empdata)

print()

print(companydata)
print()

df = pd.merge(empdata, companydata, how ='inner',on='eid')
df

   eid   ename  stipend
0    1   Rohit    23000
1    2   Varun    12000
2    3  Domnic     3000
3    4   Harsh    25000

   eid         position
0    1         employee
1    2         employee
2    3           intern
3    4  senior_employee

   eid   ename  stipend         position
0    1   Rohit    23000         employee
1    2   Varun    12000         employee
2    3  Domnic     3000           intern
3    4   Harsh    25000  senior_employee